import { useState } from 'react'
import './App.css'

function App() {
// スクロール一番下
  const toBottom = () => {
      // alert("toBottom");
      scrollBy({
        top: 10000,
        left: 0,
        behavior: 'smooth'
      });
    };
// スクロール一番上
  const toTop = () => {
      // alert("toBottom");
      scrollBy({
        top: -10000,
        left: 0,
        behavior: 'smooth'
      });
    };

  return (
    <div className="App">
      <header className="App-header">
      <section id="concept">
        {/* タイトル */}
        <h2>長い話をスクロールするボタン</h2>
        {/* ボタン */}
          <button onClick={toBottom}>↓ 長い話を飛ばす ↓</button>
          {/* スクロールいっぱい */}
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
          <h2>長い話</h2>
          <h3>長い話</h3>
          <p>長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話長い話</p>
<button onClick={toTop}>↑ 飛ばしすぎたので戻る ↑</button>
          </section>
      </header>
    </div>
  )
}

export default App
